In [1]:
2+2

4

In [11]:
a = { 
    'customers': ['A', 'B' , 'C' ,'D' ],
    'sales': [1100,959.50,'$800.00','$1100.50']
    }

In [12]:
import pandas as pd
df = pd.DataFrame(a)

In [13]:
df

  customers     sales
0         A      1100
1         B     959.5
2         C   $800.00
3         D  $1100.50

In [15]:
df['sales'] = df.sales.replace('[$,]','',regex=True).astype('float')

In [16]:
df

  customers   sales
0         A  1100.0
1         B   959.5
2         C   800.0
3         D  1100.5

In [17]:
df.sales.apply(type)

0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
Name: sales, dtype: object

In [18]:
df = pd.DataFrame({
    'A': ['foo', 'another foo bar', 'baz'],
    'B': [0, 1, 0]
})
df

                 A  B
0              foo  0
1  another foo bar  1
2              baz  0

In [19]:
df['A'].str.replace('foo', 'bar', regex=False)

0                bar
1    another bar bar
2                baz
Name: A, dtype: object

In [20]:
df['A'].str.replace('foo', 'bar', regex=False)

0                bar
1    another bar bar
2                baz
Name: A, dtype: object

In [21]:
df.replace({'foo': 'bar', 1: -1})

                 A  B
0              bar  0
1  another foo bar -1
2              baz  0

In [22]:
df['A'].str.replace('foo', 'text1').str.replace('bar', 'text2')

0                  text1
1    another text1 text2
2                    baz
Name: A, dtype: object

In [23]:
df['A'].replace({'foo': 'text1', 'bar': 'text2'}, regex=True)

0                  text1
1    another text1 text2
2                    baz
Name: A, dtype: object

In [24]:
df['A'].replace('foo', 'bar')

0                bar
1    another foo bar
2                baz
Name: A, dtype: object

In [25]:
df['A'].replace('foo', 'bar', regex=True)

0                bar
1    another bar bar
2                baz
Name: A, dtype: object